In [2]:
import pandas as pd
df = pd.read_csv('./usuarios.csv')
df

   id          nombre                       email fecha_registro
0   1      Juan Perez      juan.perez@example.com     2023-01-15
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30

# An√°lizar el data frame

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              3 non-null      int64
 1   nombre          3 non-null      object
 2   email           3 non-null      object
 3   fecha_registro  3 non-null      object
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

# Describir datos cuantitativos

In [6]:
df.describe()

        id
count  3.0
mean   2.0
std    1.0
min    1.0
25%    1.5
50%    2.0
75%    2.5
max    3.0

# Traer ultimos registros

In [8]:
df.tail()

   id          nombre                       email fecha_registro
0   1      Juan Perez      juan.perez@example.com     2023-01-15
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30

# Espacio en memoria

In [9]:
df.memory_usage(deep=True)

Index             132
id                 24
nombre            206
email             242
fecha_registro    201
dtype: int64

# Frecuencia datos

In [10]:
df['nombre'].value_counts()

nombre
Juan Perez        1
Maria Gomez       1
Carlos Sanchez    1
Name: count, dtype: int64

# Eliminar duplicados

In [11]:
df.drop_duplicates(keep='last')

   id          nombre                       email fecha_registro
0   1      Juan Perez      juan.perez@example.com     2023-01-15
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30

# Ordenar datos

In [13]:
df.sort_values('nombre', ascending=False)

   id          nombre                       email fecha_registro
1   2     Maria Gomez     maria.gomez@example.com     2023-02-20
0   1      Juan Perez      juan.perez@example.com     2023-01-15
2   3  Carlos Sanchez  carlos.sanchez@example.com     2023-03-30